app/Controllers/Auth/LoginController.php

SELECT *
FROM `t_users`
WHERE `username` = 'Rizky'
 LIMIT 1
---
    public function doLogin()
    {
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $user = $this->userModel->where('username', $username)->first();

INSERT INTO `t_users` (`name`, `username`, `password`, `created_date`) VALUES ('Yuanta', 'Admin', '$2y$10$cZvsQoEY.z54BIsfEtHPKuesjyM9SEt0.0W37DZJR2cl5YTbmt1/G', '2024-07-15 15:35:54')
---
    public function doRegister()
    {
        if ($this->request->isAJAX()) {
            $post = $this->request->getVar();

            $validation = $this->validate([
                'name' => ['rules' => 'required', 'errors' => ['required' => 'Kolom nama harus diisi']],
                'username' => ['rules' => 'required|is_unique[t_users.username]', 'errors' => ['required' => 'Kolom username harus diisi', 'is_unique' => 'Username sudah terdaftar']],
                'confirmPassword' => ['label' => 'Password', 'rules' => 'required|min_length[6]|max_length[25]|matches[password]']
            ]);

            if (!$validation) {
                $response['status'] = 'error';
                $response['msg'] = [
                    'name' => $this->validator->getError('name'),
                    'username' => $this->validator->getError('username'),
                    'password' => $this->validator->getError('confirmPassword')
                ];
            } else {
                try {
                    $data = [];
                    foreach ($post as $key => $val) {
                        $data[$key] = $val;
                    }
                    $data['password'] = password_hash((string) $data['password'], PASSWORD_DEFAULT);
                    $data['created_date'] = date('Y-m-d H:i:s');

                    $user = $this->userModel->insert($data);