app/Helpers/custom_helper.php

SELECT `type`
FROM `t_flowers_type`
GROUP BY `type`
---
function selectFlowerType(string $id, $selected = null)
{
    $html = '<select id="' . $id . '" name="' . $id . '" class="form-control jenis-tanaman" width="100%">';
    $html .= '<option value="" selected>Pilih Semua</option>';

    $db = \Config\Database::connect();

    $flowerType = $db->table('t_flowers_type')
        ->select('type')
        ->groupBy('type')
        ->get()
        ->getResult();