app/Controllers/DashboardController.php

SELECT *
FROM `t_flowers`
SELECT *
FROM `t_flowers_type`
---
    public function index()
    {
        $data['totalFlowers'] = (new FlowerModel())->sumFlowerQty();
        $data['flowers'] = (new FlowerModel())->findAll();
        $data['flowersType'] = (new FlowerTypeModel())->findAll();