app/Controllers/FeedbackController.php

INSERT INTO `feedback` (`name`, `email`, `message`, `created_at`) VALUES ('Rizky Agusti Agusti', 'rizkyagusti7@gmail.com', 'feedback', '2024-07-18 14:05:45')
---
    public function submit()
    {
        // Tangkap data dari form
        $name = $this->request->getPost('name');
        $email = $this->request->getPost('email');
        $message = $this->request->getPost('message');

        // Simpan atau lakukan sesuai kebutuhan Anda, contoh sederhana bisa menyimpan ke database atau mengirim email admin
        // Misalnya, menyimpan ke database
        $feedbackModel = new \App\Models\FeedbackModel();
        $data = [
            'name' => $name,
            'email' => $email,
            'message' => $message,
            'created_at' => date('Y-m-d H:i:s')
        ];
        $feedbackModel->insert($data);