app/Controllers/FlowerController.php

SELECT *
FROM `t_flowers`
---
    public function fetchFlowersData()
    {
        $data = $this->flowerModel->findAll();

INSERT INTO `t_flowers` (`name`, `qty`, `type`, `created_date`, `image`) VALUES ('bunga1', '1', '2', '2024-07-15 13:39:13', '1721050753_fa66beb269c131ad9b53.png')
---
                $fileName = $image->getRandomName();
                $image->move('uploads/', $fileName);
                $data['image'] = $fileName;
                $flowers = $this->flowerModel->insert($data);

SELECT *
FROM `t_flowers`
WHERE `t_flowers`.`id` = '77'
---
    public function edit($id)
    {
        $data = $this->flowerModel->find($id);